package com.rcpt.bean;

import java.util.List;

/**
 * Created by lvzp on 2017/3/29.
 * 类描述：求职指南列表的实体类
 */

public class JobGuideListBean {


    /**
     * recruitlist : [{"employmentId":39,"guideThumbnail":"","category":"0","title":"面试指导！参加面试的备战技巧","updateTimeStamp":"2017-02-23","guideContent":"<p>面试的失败多半部分源于不自信。自信的人走在哪里都有一种人格魅力吸引别人，当然面试官也不例外。想要面试成功，首先自信绝对是不可或缺的。如何才能够让自己充满自信去面试呢?当然在接到面试通知后我们要做好充分的准备。准备如下：<\/p><p>　　<strong>得体大方的着装是自信的基础<\/strong><\/p><p>　　找工作也如同商业行为，雇主是买方，你是卖方，要吸引买方，除了\u201c慧中\u201d外，还要\u201c秀外\u201d。况且，当你踏进面试会议室后给人的第一印象就是你的仪表。<\/p><p>　　考虑衣着时请先考虑公司的性质以及应聘的职位。如果公司规定穿制服的话，你就要考虑准备整洁大方的套装。如果是网络公司的话，便装也不会有太大不便。不过若你是应聘销售、公关、市场以及高级职位的，穿深色或者灰色的套装会比较合适，当然，可以用一些雅致的小饰物装扮自己。服装问题应该在面试前晚就决定，考虑周到，不要临时变卦。<\/p><p>　　对男士而言，深色西装适合任何面谈，再配上白色或者浅灰浅蓝衬衣、款式简洁的领带。切记不可选择颜色明亮的领带，廉价蹩脚的领带夹也会减分。衣服必须干净平整，头发务必梳理整齐，皮鞋擦亮，指甲清洁，另外，刮干净胡子。<\/p><p>　　女士的服装比男士有更多的选择，但仍以保守为佳：深色或者中性色的套装或夹克和裙子，配上一件端庄的衬衣(请勿加花边)，穿上与之相配的深色长统袜以及半高跟的轻便鞋子(不要穿露出脚趾或细高的鞋跟)。使用棕色或黑色的手提包，将化妆品、履历表等放在里面。裙子以过膝的一步裙为好。发型也需保守。另外，白色、亮眼的黄色橙色、粉色系列的套装不太适合面试。<\/p><p>　　<strong>了解新公司背景是话题的桥梁<\/strong><\/p><p>　　熟悉可能任职的新公司会增加面试官的印象，因为你对公司了解越多，表明你对公司及工作越有兴趣。此外，还可以增加你在面谈时的自信。了解公司越多，越能把握自己，应付如流。<\/p><p>　　尽可能了解你所申请的职位。如果你熟悉职务的性质，你将会成为强有力的申请人。值得注意的一点：为某项特殊职务做好一切准备绝对是正确的。但是你千万不可将自己局限在某项特殊职务上，而忽略对其他职务的考虑。<\/p><p>　　<strong>准备好所需物品让你面试更顺利<\/strong><\/p><p>　　钢笔或水笔两支 为什么要两支?做备份以防万一啊!带钢笔或者水笔是以备随时填写正式的表格。<\/p><p>　　记事本 面试时记录或计算可能用得到。将笔和笔记本放在手提包的外层，方便随时使用，不至于到时现翻，浪费时间又显得缺乏组织能力。<\/p><p>　　最近更新的简历 至少两份，多多益善 &nbsp;\r\n即使你的简历已使你获得面谈机会，约谈者仍有可能收取另一份履历，准备完整的履历表有两个目的：第一，在公司填写申请表时，可随时取出作为参考;第二，面谈后可直接留给公司。多准备几份的目的在于如果不止一个面试官的话，可以表现出你的仔细完备。<\/p><p><br/><\/p>","status":1},{"employmentId":38,"guideThumbnail":"","category":"0","title":"27岁的女生面试应聘总是被问什么时候结婚生子 怎么破？","updateTimeStamp":"2017-02-23","guideContent":"<p>\u201c你已经27岁了，很快就要准备结婚了吧?\u201d<\/p><p>　　\u201c我们需要你签一份协议，承诺入职两年不能生小孩。\u201d<\/p><p>　　\u201c你很优秀，我们都觉得很合适，但是没办法，我们想招一个男生。\u201d<\/p><p>　　面试时被问到有没有男朋友，准备多久结婚生小孩，到底该怎么办?<\/p><p>　<strong>　问题症结：<\/strong><\/p><p><strong>　　生育成本和收益对象的割裂<\/strong><\/p><p>　　因为怀孕，其他同事工作时间的增加，企业成本的增加，体现生育成本是被分配到女性和所在企业。然而生育意味着社会生产力的再生产，所收益的是国家、社会及家庭。<\/p><p>　　企业短期是只有成本没有收益，长期来看更是看不到收益，所以企业基于盈利的目的不愿意招可能怀孕的。<\/p><p>　　然而在中国的收益方代表比如政府和父亲则贡献非常有限，不像北欧，父亲有较多产假用来照顾母婴，也能避免企业对女性的歧视。<\/p><p>　　政府也对生育给予较多的福利以及公共设施，整个社会包括企业都能非常人性化地对待生育的女性。<\/p><p>　　职场对女性的生育歧视，显示出生育的成本和收益对象不同，导致的利益矛盾。成本是女性、家庭和企业承担，受益是家庭和社会。<\/p><p>　　怀孕意味着企业成本增加却无收益，而其他同事成本增加原则上应该给予加班费实际上很多并没有得到补偿，所以女性在职场容易受到很多的不欢迎。<\/p><p>　　3-4个月的产假是双刃剑，表面上是对女性的福利，实际上只是对生育且有固定薪酬(非以工作量衡量)工作女性(简单的说白领)的福利。<\/p><p>　　同时对不生育/未生育的女性造成歧视而导致就业机会不平等，对没有正规就业单位的(如农民、性工作者、个体经营者)/大量的工厂女工(工资是按工作量的)同样承受生育的辛苦却没有这种福利。<\/p><p>　　女性并不是一个铁板一块的群体。产假，受益的是一部分女性，然而受歧视的却是所有未生育和不生育的女性(白领为主)。<\/p><p>　　这个产假的由来，跟社会主义是无法分开的，马克思主义注重妇女权益，妇女生育必须得到福利，产假的确是对妇女怀孕的保护，而以前的企业多为国企，其经济利益与再生产的利益是被强制绑定的，文化上也认为女性生育非常光荣。<\/p><p>　　然而改革开放之后，很多国企变成不是直接私有化就是变成本质上的私企，以及私企越来越多的情况下，再生产的利益变从企业利益里剔除了，企业只注重眼前的收益和降低成本，所以企业不再欢迎女性生育是必然的。<\/p><p>　　私有制下，资本家的利益和国家社会的利益并不是一致的，甚至是冲突的。生育本是劳动力的再生产，是扩大生产的基本条件，是创造更多生活资料的力量，然而这种贡献社会的行为，对资本家没有看得见的好处。<\/p><p>　　资本家占有着生产资料，可以很强势地压低劳动者的工资和人数，让劳动者互相竞争挤压。<\/p><p>　　作为劳动者的我们没有生产资料，我们无法从事生产，所以我们不得不屈从与资本家的一切，不得不低下头去求职，害怕失业害怕没有好工作，是何等的悲哀。<\/p><p>　　独生子女和一胎半的计划生育政策，也不再是生多了是光荣妈妈了，所以文化上对女性的母性不再真正的歌颂。<\/p><p>　　但是经济制度文化都改变了之后体现出米国特色，但是预防歧视却没有跟上米国的脚步，在美国就业时询问女性是否婚姻生育是违法的，美国的产假也非常短，性别歧视的控告对一个企业的声誉影响也大，且美国对家庭主妇的经济权益也保障比我国到位。<\/p><p>　　综上所述，我国的女性是社会主义福利和法律，市场经济和丛林社会文化，所以虽然男女平等写入了宪法，但是法律啊福利在具体的经济活动和社会文化上无法得到保障。这个是根本症结所在。<\/p><p>　<strong>　职场性别歧视的恶果<\/strong><\/p><p><strong>　　将女性推回家庭<\/strong><\/p><p>　　歧视这不意味着女性会失业，只是相对于男性失去了很多不错的工作机会，比如加班多的难度高的一定程度上也是升职加薪比较快的岗位。<\/p><p>　　然而这些白领女性，也不是说我就会退而去当女工什么的，职场的不友好势必会推动女性往家庭回归，比如嫁给经济实力比自己强的男性或者干脆成为富豪的妻子或二奶，来弥补自己在职场的损失。<\/p><p>　　而这个结果毫无疑问，也促使男性不得不在工作上更加努力甚至成为赚钱机器损害身体健康，而富豪将形成实际的一夫多妻，加重婚姻上的不平等，也使女性在婚姻中由于经济地位而更加被物化和失去文化地位。<\/p><p><br/><\/p>","status":1},{"employmentId":33,"guideThumbnail":"","category":"0","title":"就业面试奇葩问题排行榜！","updateTimeStamp":"2017-02-23","guideContent":"<p>有哪个面霸这辈子遇不到几个奇葩问题呢，尤其是在需要我们脑洞大开的互联网地盘上，下面就跟着小编来瞅瞅硅谷科技公司的面试问题吧。<\/p><p>　　据英国《每日邮报》报道，进入硅谷的科技企业工作是许多人的梦想，但要想实现这一梦想，你就得先在面试中回答它们怪异的奇葩问题，而谷歌，Facebook和苹果等公司正是这种善于提奇葩问题的大师。小点的公司怎么样呢?难道它们也沾染了这种\u201c坏风气\u201d?没错，你猜对了，现在大家都以提怪异问题为荣了。<\/p><p>　　每年研究公司Glass Door都会发布一个面试奇葩问题排行榜，除了经常上榜的老科技巨头们，新兴公司如Airbnb、Dropbox和Hailo也成了榜单的常客。<\/p><p>　　下面我们精选了10个奇葩问题，如果你能顺利回答上来的话，也许就能进入梦寐以求的科技企业啦。<\/p><p>　　<strong>1 假设你完成了一天的工作，春风得意回到家后，觉得自己从事的是世界最棒的工作，那么是什么让你如此高兴呢?<\/strong><\/p><p>　　这是来自Facebook的怪异问题，可能许多人会回答涨工资啦，放假啦，家人有喜了什么的，但这都不是正确答案。真正正确的答案要突出Facebook的使命，那就是\u201c在工作中让人们享受到了分享的力量，还帮助公司开放并连通全世界。\u201d<\/p><p>　<strong>　2 如果你突然缩小到硬币那么高，还被人狠心扔进搅拌机中，假设这时你的密度不变，而搅拌机一分钟后就会开启，你会怎么做?<\/strong><\/p><p>　　这是来自谷歌的烧脑问题，它需要非常强的跳跃思维。许多人会觉得这种情况下自己死定了，但这个问题的关键就在于人体密度，由于密度不变，你还是会有正常人类的力量，这种力量搭配一个硬币大小的身材，想跳出搅拌机实在是太轻松了。<\/p><p>　<strong>　3 一个男人将熄火的汽车推到了酒店，但却发现自己的钱丢了，这是为什么呢?<\/strong><\/p><p>　　这也是谷歌的刁钻问题，有点像脑筋急转弯，其实答案很简单：因为这个男人在玩大富翁棋(Monopoly，也有垄断的意思)，不过笔者觉得谷歌也在暗示自己总是因\u201c垄断\u201d被罚。<\/p><p>　<strong>　4 如果我向你最好的朋友打听你的情况，你觉得他认为你最大的缺点在哪?<\/strong><\/p><p>　　这个问题来自苹果，问的可一点都不委婉。这个问题还真不好回答，但至少你不能说自己很懒或者喜欢说谎。<\/p><p>　　<strong>5 如果上帝要赋予你超能力，你选择能隐身还是能飞?<\/strong><\/p><p>　　这是微软的面试问题，它们要选一个高级别的产品经理。确实，这两项超能力都很牛，但这里面却包含了一个心理学的小陷阱。如果你选了隐身，那就意味着你生性胆怯，而且比较腼腆。选择飞行能力则代表你比较勇敢，而且不会怯场，这样才能成为一个好领导。不过也许最好的答案不是二选一，而是\u201c这问题很简单，我选择隐身，因为我已经会飞了。\u201d<\/p><p>　<strong>　6 如果一觉醒来，你发现邮箱里堆了2000封未读邮件，但由于时间限制只能回复其中300封，你会如何安排回复次序呢?<\/strong><\/p><p>　　这个刁钻的问题来自Dropbox，也许它们的意思是老板的邮件优先吧。<\/p><p><strong>　　7 如果你恰好成了一次坠机事故中的唯一生还者，你会怎么做?<\/strong><\/p><p>　　这是Airbnb针对信任和安全调查员职位专门出的问题。最火的答案是\u201c不容易啊，今天居然享受了一把私人飞机。\u201d另一个比较泛滥的答案则是：\u201c我会打开手机告诉领导说，不好意思今天要迟到了。\u201d<\/p><p>　　<strong>8 上世纪90年代出名的明星中，你最喜欢谁?<\/strong><\/p><p>　　这个问题来自Squarespace。这公司也是够坏，问这种问题纯粹是为了让人暴露年龄嘛。<\/p><p>　　<strong>9 如果杰夫·贝佐斯走进你的办公室，告诉你他将给你100万美元来支持你创业，你准备做点什么?<\/strong><\/p><p>　　亚马逊一直都是\u201c野心家\u201d，所以它们的员工也得有各种创意十足的点子。经过深思熟虑，笔者觉得最好的回答是：\u201c现在不能告诉你，因为我还在面试，等亚马逊愿意收留我了再告诉你。\u201d<\/p><p>　　<strong>10 假设有一个大水槽，而你坐在水槽中漂浮的一艘小船上，船上有一个相当重的大铁锚，如果你把铁锚抛到水槽外，这时水槽中的水位是会上升还是会下降?<\/strong><\/p><p>　　这是特斯拉在面试机械工程师时提的问题，正确答案是水位下降。为什么呢?因为铁锚的密度大于水，因此它会让船的排水量增大，造成水位上升，所以如果将锚抛出去，水位自然就会下降。<\/p><p><br/><\/p>","status":1},{"employmentId":32,"guideThumbnail":"","category":"0","title":"面试用对这四招 满意工资轻松到手","updateTimeStamp":"2017-02-23","guideContent":"<p>争取薪水时切忌贪心，免得自己因小失大，反而错失了机会。勇于争取的同时，要有轻重之分，如果已经争取到了最重要的，那就适时退让一下，达成双赢的局面，对未来的工作也有帮助。<\/p><p>　　面试时说得再冠冕堂皇，对于求职者来说最后都要落实到工资上。即便一份工作再优秀，当工资太低时，心里难免会有些犹豫。毕竟每个人的生活、开销，都要用钱来换取的。那么，如何在面试的过程中正确争取到理想的工资呢?也许你可以试试这几招\u2014\u2014<\/p><p>　　<strong>第1招：知己知彼<\/strong><\/p><p>　　对企业的薪酬幅度有一个整体的了解之后，你会对自己的工资水平有一个更加明确的了解，包括日后的涨薪情况等。<\/p><p>　　面试时面试官一定会给你一个提问的时间，你可以就企业的薪酬体系提出问题，一般面试官都会做一些简单的介绍，包括一些福利、奖金等情况。根据这些介绍，再比对现在的行业情况，就会有一个比较完整的了解。然后再根据这些信息，给自己估计一个合适的薪酬区间。<\/p><p>　　<strong>第2招：合理利用区间<\/strong><\/p><p>　　一些面试中，面试官会让你填写自己期望的薪酬，这种时候合理利用区间是非常必要的，一般而言不建议将最低值写得太低，因为大部分招聘企业会选择较低的那个数值作为你的薪酬。所以这个薪酬区间最低值应该是你可以接受的薪酬，而最高值是你的理想薪酬，如此更有沟通的余地。当然，这类区间要结合行业和企业本身的情况填写，切不可随意为止。<\/p><p><strong>第3招：迂回试探<\/strong><\/p><p>　　很多企业在一开始给出薪酬的时候是有所保留的，你可以试着用试探、协商的语气提出对薪酬的要求。<\/p><p>　　如果面试官有所松动，表示可以协商，你可以适时提出自己的价值。比如销售可以说说自己曾经最好的业绩;IT可以说说自己最优秀的产品;财务人可以列举自己为公司做的大项目与收益情况，以及自己拥有的诸如ACCA、USCPA或CPA之类的高含金量的证书资格。<\/p><p>　　如果面试官表示薪酬是有规定的，不能调整，这类情况更多发生在应届生的身上，那么你可以试着要求缩短试用期，提早拿到转正的工资。<\/p><p>　<strong>　第4招：多争取额外的福利<\/strong><\/p><p>　　如果你争取不到更高的工资、也没有提早结束试用期的可能，那么多争取一些福利也是不错的。这种福利包含了物质和非物质两种，物质的无外乎是奖金、加班费之类，最好是白纸黑字写下来的承诺;非物质的包括假期或调休、晋升的机会、培训的机会等。现在很多公司都会为内部人员安排各种各样的培训，但这些培训有些是有名额或者限制的，尤其是那些请外部的培训机构如高顿财经，或是知名的成功人士等进行的专业培训、讲座，参与者往往受益匪浅，对自己的专业领域发展有积极作用。如果能得到这样的机会，对于自身的职业进步，乃至加薪，都是助力。<\/p><p>　　最后，争取薪水时切忌贪心，免得自己因小失大，反而错失了机会。勇于争取的同时，要有轻重之分，如果已经争取到了最重要的，那就适时退让一下，达成双赢的局面，对未来的工作也有帮助。<\/p><p><br/><\/p>","status":1}]
     * totalPage : 1
     * isNext : false
     */

    private String totalPage;
    private boolean isNext;
    private List<RecruitlistBean> recruitlist;

    public String getTotalPage() {
        return totalPage;
    }

    public void setTotalPage(String totalPage) {
        this.totalPage = totalPage;
    }

    public boolean isNext() {
        return isNext;
    }

    public void setNext(boolean next) {
        isNext = next;
    }

    public List<RecruitlistBean> getRecruitlist() {
        return recruitlist;
    }

    public void setRecruitlist(List<RecruitlistBean> recruitlist) {
        this.recruitlist = recruitlist;
    }

    public static class RecruitlistBean {
        /**
         * employmentId : 39
         * guideThumbnail :
         * category : 0
         * title : 面试指导！参加面试的备战技巧
         * updateTimeStamp : 2017-02-23
         * guideContent : <p>面试的失败多半部分源于不自信。自信的人走在哪里都有一种人格魅力吸引别人，当然面试官也不例外。想要面试成功，首先自信绝对是不可或缺的。如何才能够让自己充满自信去面试呢?当然在接到面试通知后我们要做好充分的准备。准备如下：</p><p>　　<strong>得体大方的着装是自信的基础</strong></p><p>　　找工作也如同商业行为，雇主是买方，你是卖方，要吸引买方，除了“慧中”外，还要“秀外”。况且，当你踏进面试会议室后给人的第一印象就是你的仪表。</p><p>　　考虑衣着时请先考虑公司的性质以及应聘的职位。如果公司规定穿制服的话，你就要考虑准备整洁大方的套装。如果是网络公司的话，便装也不会有太大不便。不过若你是应聘销售、公关、市场以及高级职位的，穿深色或者灰色的套装会比较合适，当然，可以用一些雅致的小饰物装扮自己。服装问题应该在面试前晚就决定，考虑周到，不要临时变卦。</p><p>　　对男士而言，深色西装适合任何面谈，再配上白色或者浅灰浅蓝衬衣、款式简洁的领带。切记不可选择颜色明亮的领带，廉价蹩脚的领带夹也会减分。衣服必须干净平整，头发务必梳理整齐，皮鞋擦亮，指甲清洁，另外，刮干净胡子。</p><p>　　女士的服装比男士有更多的选择，但仍以保守为佳：深色或者中性色的套装或夹克和裙子，配上一件端庄的衬衣(请勿加花边)，穿上与之相配的深色长统袜以及半高跟的轻便鞋子(不要穿露出脚趾或细高的鞋跟)。使用棕色或黑色的手提包，将化妆品、履历表等放在里面。裙子以过膝的一步裙为好。发型也需保守。另外，白色、亮眼的黄色橙色、粉色系列的套装不太适合面试。</p><p>　　<strong>了解新公司背景是话题的桥梁</strong></p><p>　　熟悉可能任职的新公司会增加面试官的印象，因为你对公司了解越多，表明你对公司及工作越有兴趣。此外，还可以增加你在面谈时的自信。了解公司越多，越能把握自己，应付如流。</p><p>　　尽可能了解你所申请的职位。如果你熟悉职务的性质，你将会成为强有力的申请人。值得注意的一点：为某项特殊职务做好一切准备绝对是正确的。但是你千万不可将自己局限在某项特殊职务上，而忽略对其他职务的考虑。</p><p>　　<strong>准备好所需物品让你面试更顺利</strong></p><p>　　钢笔或水笔两支 为什么要两支?做备份以防万一啊!带钢笔或者水笔是以备随时填写正式的表格。</p><p>　　记事本 面试时记录或计算可能用得到。将笔和笔记本放在手提包的外层，方便随时使用，不至于到时现翻，浪费时间又显得缺乏组织能力。</p><p>　　最近更新的简历 至少两份，多多益善 &nbsp;
         * 即使你的简历已使你获得面谈机会，约谈者仍有可能收取另一份履历，准备完整的履历表有两个目的：第一，在公司填写申请表时，可随时取出作为参考;第二，面谈后可直接留给公司。多准备几份的目的在于如果不止一个面试官的话，可以表现出你的仔细完备。</p><p><br/></p>
         * status : 1
         */

        private String employmentId;
        private String guideThumbnail;
        private String category;
        private String title;
        private String updateTimeStamp;
        private String guideContent;
        private int status;

        public String getEmploymentId() {
            return employmentId;
        }

        public void setEmploymentId(String employmentId) {
            this.employmentId = employmentId;
        }

        public String getGuideThumbnail() {
            return guideThumbnail;
        }

        public void setGuideThumbnail(String guideThumbnail) {
            this.guideThumbnail = guideThumbnail;
        }

        public String getCategory() {
            return category;
        }

        public void setCategory(String category) {
            this.category = category;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getUpdateTimeStamp() {
            return updateTimeStamp;
        }

        public void setUpdateTimeStamp(String updateTimeStamp) {
            this.updateTimeStamp = updateTimeStamp;
        }

        public String getGuideContent() {
            return guideContent;
        }

        public void setGuideContent(String guideContent) {
            this.guideContent = guideContent;
        }

        public int getStatus() {
            return status;
        }

        public void setStatus(int status) {
            this.status = status;
        }
    }
}
